CanHaveStructuralSection Method
 Identifies if this Family can have a structural section.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2016
 Syntax
  C#
public bool CanHaveStructuralSection()
  Visual Basic
Public Function CanHaveStructuralSection As Boolean
  Visual C++
public:
bool CanHaveStructuralSection()
 Return Value
 True if the Family can have structural section, false otherwise.
 See Also
  Family Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →